tap "sst/tap"
brew "caddy"
brew "fzf"
brew "gcc"
brew "git-xet"
brew "jq"
brew "lychee"
brew "yt-dlp"
brew "mpv"
brew "nvtop"
brew "opencode"
brew "railway"
brew "rclone"
brew "shfmt"
brew "starship"
brew "stow"
cask "android-platform-tools"
vscode "13xforever.language-x86-64-assembly"
vscode "adpyke.codesnap"
vscode "agutierrezr.emmet-keybindings"
vscode "amazonwebservices.aws-toolkit-vscode"
vscode "astral-sh.ty"
vscode "astro-build.astro-vscode"
vscode "bierner.github-markdown-preview"
vscode "bierner.markdown-checkbox"
vscode "bierner.markdown-emoji"
vscode "bierner.markdown-footnotes"
vscode "bierner.markdown-mermaid"
vscode "bierner.markdown-preview-github-styles"
vscode "bierner.markdown-yaml-preamble"
vscode "biomejs.biome"
vscode "bradlc.vscode-tailwindcss"
vscode "bufbuild.vscode-buf"
vscode "catppuccin.catppuccin-vsc"
vscode "charliermarsh.ruff"
vscode "christian-kohler.npm-intellisense"
vscode "christian-kohler.path-intellisense"
vscode "cleanthemes.matte-black-theme"
vscode "cweijan.dbclient-jdbc"
vscode "cweijan.vscode-mysql-client2"
vscode "davidanson.vscode-markdownlint"
vscode "dbaeumer.vscode-eslint"
vscode "docker.docker"
vscode "eamodio.gitlens"
vscode "enkia.tokyo-night"
vscode "esbenp.prettier-vscode"
vscode "fastapilabs.fastapi-vscode"
vscode "fill-labs.dependi"
vscode "foxundermoon.shell-format"
vscode "github.codespaces"
vscode "github.copilot-chat"
vscode "github.github-vscode-theme"
vscode "github.remotehub"
vscode "github.vscode-github-actions"
vscode "github.vscode-pull-request-github"
vscode "golang.go"
vscode "grapecity.gc-excelviewer"
vscode "graphql.vscode-graphql"
vscode "graphql.vscode-graphql-syntax"
vscode "gruntfuggly.todo-tree"
vscode "jdinhlife.gruvbox"
vscode "jovejonovski.ocean-green"
vscode "matthewpi.caddyfile-support"
vscode "mechatroner.rainbow-csv"
vscode "mhutchie.git-graph"
vscode "monokai.theme-monokai-pro-vscode"
vscode "ms-azuretools.vscode-containers"
vscode "ms-python.debugpy"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-python.vscode-python-envs"
vscode "ms-toolsai.datawrangler"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode-remote.vscode-remote-extensionpack"
vscode "ms-vscode.cmake-tools"
vscode "ms-vscode.cpp-devtools"
vscode "ms-vscode.cpptools"
vscode "ms-vscode.cpptools-extension-pack"
vscode "ms-vscode.cpptools-themes"
vscode "ms-vscode.makefile-tools"
vscode "ms-vscode.remote-explorer"
vscode "ms-vscode.remote-repositories"
vscode "ms-vscode.remote-server"
vscode "ms-vsliveshare.vsliveshare"
vscode "mshr-h.veriloghdl"
vscode "mvllow.rose-pine"
vscode "myriad-dreamin.tinymist"
vscode "nvidia.nsight-vscode-edition"
vscode "pomdtr.excalidraw-editor"
vscode "qufiwefefwoyn.kanagawa"
vscode "rangav.vscode-thunder-client"
vscode "redhat.vscode-yaml"
vscode "ritwickdey.liveserver"
vscode "rust-lang.rust-analyzer"
vscode "sanjulaganepola.github-local-actions"
vscode "sst-dev.opencode"
vscode "svelte.svelte-vscode"
vscode "tamasfe.even-better-toml"
vscode "tomoki1207.pdf"
vscode "usernamehw.errorlens"
vscode "vadimcn.vscode-lldb"
vscode "vivaxy.vscode-conventional-commits"
vscode "vscode-icons-team.vscode-icons"
vscode "vscodevim.vim"
vscode "xabikos.javascriptsnippets"
vscode "yoavbls.pretty-ts-errors"
vscode "yzane.markdown-pdf"
go "cmd/go"
go "cmd/gofmt"
go "golang.org/x/tools/gopls"
cargo "bacon"
cargo "caligula"
cargo "cargo-binstall"
cargo "cargo-cache"
cargo "leetcode-cli"
cargo "tokei"
cargo "typst-cli"
cargo "typstyle"
cargo "websocat"
cargo "yazi-cli"
cargo "yazi-fm"
uv "huggingface-hub[cli]"
uv "maturin"
uv "puddletag"
flatpak "com.slack.Slack"
flatpak "com.stremio.Stremio"
flatpak "md.obsidian.Obsidian"
flatpak "org.gimp.GIMP"
flatpak "org.kde.kdenlive"
flatpak "org.octave.Octave"
flatpak "us.zoom.Zoom"
